import ServiceHeader from "../include/ServiceHeader";

const Service = () => {
    return(
<>
  <div className="Min390Max">
  <ServiceHeader/>
  <div className="term-wrap mt-80">
<div>
    <h2 className="mt-4">제1조(목적)</h2>
    <p>이 약관은 회사가 제공하는 '나다운' 서비스의 이용과 관련하여 회사와 이용자 간의 권리, 
        의무 및 책임사항을 규정함을 목적으로 합니다. 본 약관은 서비스 이용과 관련된 모든 사항에 대해 적용됩니다.</p>
</div>

<div>
    <h2 className="mt-4">제2조[정의]</h2>
    <p>"서비스"란 회사가 제공하는 생년월일 및 태어난 시간 입력을 통해 사주, 타로 등의 운세 콘텐츠를 제공하는 웹 기반 서비스를 의미합니다.
"이용자"란 본 약관에 따라 회사가 제공하는 서비스를 이용하는 자를 말합니다.
"회원"이란 카카오 로그인을 통해 유료 서비스를 이용하는 자를 의미합니다.
"비회원"이란 회원 가입 없이 무료 서비스를 이용하는 자를 의미합니다.
"유료 서비스"란 로그인 후 결제하여 이용 가능한 프리미엄 콘텐츠를 포함한 모든 서비스입니다.
"컨텐츠"란 사주, 타로, 운세 관련 정보, 글, 이미지, 동영상 등 회사가 제공하는 모든 자료를 의미합니다.</p>
</div>

<div>
    <h2 className="mt-4">제3조[약간의 효력 및 변경]</h2>
    <p>이 약관은 회사가 웹사이트에 게시하거나 기타의 방법으로 이용자에게 공지함으로써 효력이 발생합니다.
회사는 관련 법령의 개정, 서비스 운영상의 필요 또는 정책 변화에 따라 약관을 변경할 수 있습니다. 변경된 약관은 제1항과 같은 방법으로 공지됩니다.
이용자가 약관 변경을 수락하지 않을 경우, 서비스 이용을 중단하고 회원 탈퇴를 요청할 수 있습니다. 변경된 약관의 효력 발생일 이후에도 서비스를 계속 이용하는 경우 약관 변경에 동의한 것으로 간주됩니다.</p>
</div>

<div>
<h2 className="mt-4">고객센터</h2>
<p>이메일:stargiosoft@gmail.com</p>
</div>

<div>
    <h2 className="mt-4">부칙</h2>
    <p>(시행일)이 약관은 2025년 10월 22일부터 시행합니다</p>
</div>
  </div>
   </div> 
</>
    );
}
export default Service;